lib/tasks/create_test_bonuses.rake

    created_bonuses = []

    bonuses_data.each do |bonus_attrs|
      bonus = Bonus.create!(bonus_attrs)
---
INSERT INTO "bonuses" ("name", "code", "bonus_type", "status", "minimum_deposit", "wager", "maximum_winnings", "wagering_strategy", "availability_start_date", "availability_end_date", "user_group", "tags", "country", "currency", "created_by", "updated_by", "created_at", "updated_at", "project", "dsl_tag") VALUES ('Welcome Bonus 100%', 'WELCOME100', 'deposit', 'active', NULL, 1000.0, 500.0, 'standard', '2025-08-12 00:00:00', '2025-09-11 00:00:00', 'new_users', 'welcome, first_deposit, high_value', 'US', 'USD', 1, 1, '2025-08-12 20:08:44.328940', '2025-08-12 20:08:44.328940', 'VOLNA', 'welcome_bonus') RETURNING "id"

      # Создаем связанную запись deposit_bonus
      case bonus.name
      when "Welcome Bonus 100%"
        bonus.create_deposit_bonus!(
          deposit_amount_required: 10.00,
          bonus_percentage: 100.00,
          max_bonus_amount: 500.00,
          first_deposit_only: true,
          recurring_eligible: false
        )
      when "Reload Bonus 50%"
        bonus.create_deposit_bonus!(
          deposit_amount_required: 25.00,
          bonus_percentage: 50.00,
          max_bonus_amount: 250.00,
          first_deposit_only: false,
          recurring_eligible: true
        )
      when "VIP Bonus 200%"
        bonus.create_deposit_bonus!(
          deposit_amount_required: 100.00,
          bonus_percentage: 200.00,
          max_bonus_amount: 2000.00,
          first_deposit_only: false,
          recurring_eligible: true
        )
      when "Weekend Special 75%"
        bonus.create_deposit_bonus!(
          deposit_amount_required: 20.00,
          bonus_percentage: 75.00,
          max_bonus_amount: 150.00,
          first_deposit_only: false,
          recurring_eligible: false
        )
      when "First Deposit 150%"
        bonus.create_deposit_bonus!(
          deposit_amount_required: 50.00,
          bonus_percentage: 150.00,
          max_bonus_amount: 750.00,
          first_deposit_only: true,
          recurring_eligible: false
        )
---
INSERT INTO "deposit_bonuses" ("bonus_id", "deposit_amount_required", "bonus_percentage", "max_bonus_amount", "first_deposit_only", "recurring_eligible", "created_at", "updated_at") VALUES (1, 10.0, 100.0, 500.0, 1, 0, '2025-08-12 20:08:44.349629', '2025-08-12 20:08:44.349629') RETURNING "id"
INSERT INTO "deposit_bonuses" ("bonus_id", "deposit_amount_required", "bonus_percentage", "max_bonus_amount", "first_deposit_only", "recurring_eligible", "created_at", "updated_at") VALUES (2, 25.0, 50.0, 250.0, 0, 1, '2025-08-12 20:08:44.362008', '2025-08-12 20:08:44.362008') RETURNING "id"
INSERT INTO "deposit_bonuses" ("bonus_id", "deposit_amount_required", "bonus_percentage", "max_bonus_amount", "first_deposit_only", "recurring_eligible", "created_at", "updated_at") VALUES (3, 100.0, 200.0, 2000.0, 0, 1, '2025-08-12 20:08:44.373449', '2025-08-12 20:08:44.373449') RETURNING "id"
INSERT INTO "deposit_bonuses" ("bonus_id", "deposit_amount_required", "bonus_percentage", "max_bonus_amount", "first_deposit_only", "recurring_eligible", "created_at", "updated_at") VALUES (4, 20.0, 75.0, 150.0, 0, 0, '2025-08-12 20:08:44.381356', '2025-08-12 20:08:44.381356') RETURNING "id"
INSERT INTO "deposit_bonuses" ("bonus_id", "deposit_amount_required", "bonus_percentage", "max_bonus_amount", "first_deposit_only", "recurring_eligible", "created_at", "updated_at") VALUES (5, 50.0, 150.0, 750.0, 1, 0, '2025-08-12 20:08:44.388201', '2025-08-12 20:08:44.388201') RETURNING "id"

  task create_52_test_bonuses: :environment do
    puts "Creating 52 test bonuses of different types..."

    # Clear existing test bonuses to avoid duplicates
    Bonus.where("name LIKE ?", "Test Bonus%").destroy_all
---
DELETE FROM "bonuses" WHERE "bonuses"."id" = 6
SELECT "bonuses".* FROM "bonuses" WHERE (name LIKE 'Test Bonus%')

        dsl_tag: "test_#{bonus_type}_#{i + 1}"
      }

      bonus = Bonus.create!(bonus_attrs)
---
INSERT INTO "bonuses" ("name", "code", "bonus_type", "status", "minimum_deposit", "wager", "maximum_winnings", "wagering_strategy", "availability_start_date", "availability_end_date", "user_group", "tags", "country", "currency", "created_by", "updated_by", "created_at", "updated_at", "project", "dsl_tag") VALUES ('Test Bonus 1 - Deposit', 'TESTDEPOSIT1', 'deposit', 'active', NULL, 446.0, 629.0, 'vip', '2025-08-10 00:00:00', '2025-12-13 00:00:00', 'new_users', 'deposit, test, volna', 'US', 'USD', 1, 1, '2025-08-12 20:22:17.585142', '2025-08-12 20:22:17.585142', 'VOLNA', 'test_deposit_1') RETURNING "id"

      # Create type-specific bonus records
      case bonus_type
      when 'deposit'
        bonus.create_deposit_bonus!(
          deposit_amount_required: rand(10..200).to_f,
          bonus_percentage: rand(25..200).to_f,
          max_bonus_amount: rand(100..1000).to_f,
          first_deposit_only: [true, false].sample,
          recurring_eligible: [true, false].sample
        )
      when 'input_coupon'
        bonus.create_input_coupon_bonus!(
          coupon_code: "COUPON#{i + 1}",
          usage_limit: rand(10..1000),
          expires_at: Date.current + rand(30..365).days,
          single_use: [true, false].sample
        )
---
INSERT INTO "deposit_bonuses" ("bonus_id", "deposit_amount_required", "bonus_percentage", "max_bonus_amount", "first_deposit_only", "recurring_eligible", "created_at", "updated_at") VALUES (6, 52.0, 25.0, 433.0, 1, 0, '2025-08-12 20:22:17.604652', '2025-08-12 20:22:17.604652') RETURNING "id"
INSERT INTO "input_coupon_bonuses" ("bonus_id", "coupon_code", "usage_limit", "usage_count", "expires_at", "single_use", "created_at", "updated_at") VALUES (7, 'COUPON2', 402, 0, '2026-03-01 00:00:00', 1, '2025-08-12 20:22:17.624237', '2025-08-12 20:22:17.624237') RETURNING "id"

        approval_required = [true, false].sample
        auto_apply = approval_required ? false : [true, false].sample

        bonus.create_manual_bonus!(
          admin_notes: "Test manual bonus #{i + 1}",
          approval_required: approval_required,
          auto_apply: auto_apply,
          conditions: "Test conditions for bonus #{i + 1}"
        )
      when 'collection'
        bonus.create_collect_bonus!(
          collection_type: %w[daily weekly monthly fixed_amount percentage].sample,
          collection_amount: rand(5..100).to_f,
          collection_frequency: %w[daily weekly monthly once].sample,
          collection_limit: rand(5..50)
        )
      when 'groups_update'
        bonus.create_groups_update_bonus!(
          target_groups: "[\"group_#{i + 1}\", \"group_#{i + 2}\"]",
          update_type: %w[add_bonus remove_bonus modify_bonus bulk_apply].sample,
          update_parameters: "{\"param_#{i + 1}\": \"value_#{i + 1}\"}",
          batch_size: rand(100..1000)
        )
      when 'scheduler'
        bonus.create_scheduler_bonus!(
          schedule_type: %w[recurring one_time cron_based interval_based].sample,
          cron_expression: "0 #{rand(0..23)} * * *",
          next_run_at: Time.current + rand(1..7).days,
          max_executions: rand(10..1000)
        )
---
INSERT INTO "manual_bonuses" ("bonus_id", "admin_notes", "approval_required", "auto_apply", "conditions", "created_at", "updated_at") VALUES (11, 'Test manual bonus 3', 1, 0, 'Test conditions for bonus 3', '2025-08-12 20:22:35.603062', '2025-08-12 20:22:35.603062') RETURNING "id"
INSERT INTO "collect_bonuses" ("bonus_id", "collection_type", "collection_amount", "collection_frequency", "collection_limit", "collected_count", "created_at", "updated_at") VALUES (16, 'percentage', 34.0, 'daily', 31, 0, '2025-08-12 20:22:50.099992', '2025-08-12 20:22:50.099992') RETURNING "id"
INSERT INTO "groups_update_bonuses" ("bonus_id", "target_groups", "update_type", "update_parameters", "batch_size", "processing_status", "created_at", "updated_at") VALUES (22, '["group_5", "group_6"]', 'modify_bonus', '{"param_5": "value_5"}', 859, 'pending', '2025-08-12 20:23:05.006348', '2025-08-12 20:23:05.006348') RETURNING "id"
INSERT INTO "scheduler_bonuses" ("bonus_id", "schedule_type", "cron_expression", "next_run_at", "last_run_at", "execution_count", "max_executions", "created_at", "updated_at") VALUES (29, 'interval_based', '0 15 * * *', '2025-08-13 20:23:18.149381', NULL, 0, 821, '2025-08-12 20:23:18.149447', '2025-08-12 20:23:18.149447') RETURNING "id"

      count = created_bonuses.count { |b| b.bonus_type == type }
      puts "  #{type.humanize}: #{count}"
    end
    puts "\nTotal bonuses in database: #{Bonus.count}"
---
SELECT COUNT(*) FROM "bonuses"