lib/tasks/create_test_heatmap_data.rake

SELECT COUNT(*) FROM "bonuses" WHERE "bonuses"."availability_start_date" BETWEEN '2024-07-01 00:00:00' AND '2024-07-31 23:59:59.999999'
DELETE FROM "bonuses" WHERE "bonuses"."id" = 5
SELECT "bonuses".* FROM "bonuses" WHERE "bonuses"."availability_start_date" BETWEEN '2024-07-01 00:00:00' AND '2024-07-31 23:59:59.999999'
---
  task create_test_data: :environment do
    puts "Creating test bonus data for July 2025..."

    # Удаляем существующие тестовые данные для июля 2025
    july_start = Date.new(2025, 7, 1).beginning_of_day
    july_end = Date.new(2025, 7, 31).end_of_day

    existing_count = Bonus.where(availability_start_date: july_start..july_end).count
    if existing_count > 0
      puts "Found #{existing_count} existing bonuses for July 2025. Deleting..."
      Bonus.where(availability_start_date: july_start..july_end).destroy_all

INSERT INTO "bonuses" ("name", "code", "bonus_type", "status", "minimum_deposit", "wager", "maximum_winnings", "wagering_strategy", "availability_start_date", "availability_end_date", "user_group", "tags", "country", "currency", "created_by", "updated_by", "created_at", "updated_at") VALUES ('Test Deposit Bonus 0701-1', 'BONUS_CD06BD93', 'deposit', 'active', NULL, NULL, NULL, NULL, '2024-07-01 00:00:00', '2024-07-01 23:59:59.999999', 'test_users', 'heatmap_test, july_2024', 'US', 'USD', NULL, NULL, '2025-08-11 21:59:45.934264', '2025-08-11 21:59:45.934264') RETURNING "id"
---
        event_type = types[i % types.length]

        # Создаем основной бонус
        bonus = Bonus.create!(
          name: "Test #{event_type.humanize} Bonus #{date.strftime('%m%d')}-#{i+1}",
          event: event_type,
          status: "active",
          availability_start_date: date.beginning_of_day + i.minutes,
          availability_end_date: date.end_of_day,
          currencies: [ "USD" ],
          country: "US",
          user_group: "test_users",
          tags: "heatmap_test, july_2025",
          maximum_winnings_type: "fixed"
        )

INSERT INTO "deposit_bonuses" ("bonus_id", "deposit_amount_required", "bonus_percentage", "max_bonus_amount", "first_deposit_only", "recurring_eligible", "created_at", "updated_at") VALUES (5, 50.0, 100.0, 500.0, 0, 1, '2025-08-11 21:59:45.958007', '2025-08-11 21:59:45.958007') RETURNING "id"
INSERT INTO "input_coupon_bonuses" ("bonus_id", "coupon_code", "usage_limit", "usage_count", "expires_at", "single_use", "created_at", "updated_at") VALUES (12, 'TEST07081', 100, 0, '2025-08-18 23:59:59.999999', 0, '2025-08-11 21:59:55.557872', '2025-08-11 21:59:55.557872') RETURNING "id"
INSERT INTO "manual_bonuses" ("bonus_id", "admin_notes", "approval_required", "auto_apply", "conditions", "created_at", "updated_at") VALUES (7, 'Test manual bonus for heatmap testing', 0, 1, 'Test conditions for heatmap', '2025-08-11 21:59:45.983280', '2025-08-11 21:59:45.983280') RETURNING "id"
INSERT INTO "collect_bonuses" ("bonus_id", "collection_type", "collection_amount", "collection_frequency", "collection_limit", "collected_count", "created_at", "updated_at") VALUES (18, 'daily', 25.0, 'daily', 1, 0, '2025-08-11 22:00:07.969363', '2025-08-11 22:00:07.969363') RETURNING "id"
INSERT INTO "groups_update_bonuses" ("bonus_id", "target_groups", "update_type", "update_parameters", "batch_size", "processing_status", "created_at", "updated_at") VALUES (45, '["test_group_1", "test_group_2"]', 'bulk_apply', '{"amount": 100}', 50, 'completed', '2025-08-11 22:00:37.319712', '2025-08-11 22:00:37.319712') RETURNING "id"
INSERT INTO "scheduler_bonuses" ("bonus_id", "schedule_type", "cron_expression", "next_run_at", "last_run_at", "execution_count", "max_executions", "created_at", "updated_at") VALUES (25, 'recurring', '0 12 * * *', '2024-07-13 00:00:00', '2024-07-12 00:00:00', 1, 30, '2025-08-11 22:00:19.911531', '2025-08-11 22:00:19.911531') RETURNING "id"
---
        # Создаем связанную запись в зависимости от типа бонуса
        case event_type
        when "deposit"
          DepositBonus.create!(
            bonus: bonus,
            deposit_amount_required: 50.0,
            bonus_percentage: 100.0,
            max_bonus_amount: 500.0,
            first_deposit_only: false,
            recurring_eligible: true
          )
        when "input_coupon"
          InputCouponBonus.create!(
            bonus: bonus,
            coupon_code: "TEST#{date.strftime('%m%d')}#{i+1}#{SecureRandom.hex(3)}",
            usage_limit: 100,
            usage_count: 0,
            expires_at: Date.current.end_of_day + 1.week,
            single_use: false
          )
        when "manual"
          ManualBonus.create!(
            bonus: bonus,
            admin_notes: "Test manual bonus for heatmap testing",
            approval_required: false,
            auto_apply: true,
            conditions: "Test conditions for heatmap"
          )
        when "collection"
          CollectBonus.create!(
            bonus: bonus,
            collection_type: "daily",
            collection_amount: 25.0,
            collection_frequency: "daily",
            collection_limit: 1,
            collected_count: 0
          )
        when "groups_update"
          GroupsUpdateBonus.create!(
            bonus: bonus,
            target_groups: '["test_group_1", "test_group_2"]',
            update_type: "bulk_apply",
            update_parameters: '{"amount": 100}',
            batch_size: 50,
            processing_status: "completed"
          )
        when "scheduler"
          SchedulerBonus.create!(
            bonus: bonus,
            schedule_type: "recurring",
            cron_expression: "0 12 * * *",
            next_run_at: date.beginning_of_day + 12.hours,
            last_run_at: date.beginning_of_day,
            execution_count: 1,
            max_executions: 30
          )