lib/tasks/create_test_marketing_data.rake


    unique_partners.each_with_index do |partner_data, index|
      # Создаем заявку для каждого уникального партнера
      request = MarketingRequest.create!(
        manager: partner_data[:manager],
        platform: partner_data[:platform],
        partner_email: partner_data[:email],
        promo_code: partner_data[:codes].join(", "),  # Несколько кодов в одной заявке
        stag: partner_data[:stag],
        status: [ "pending", "activated", "rejected" ].sample,
        request_type: partner_data[:type],
        activation_date: rand(2) == 0 ? nil : rand(3).days.ago
      )
---
SELECT "marketing_requests".* FROM "marketing_requests"
INSERT INTO "marketing_requests" ("manager", "platform", "partner_email", "promo_code", "stag", "activation_date", "status", "request_type", "created_at", "updated_at") VALUES ('Анна Иванова', 'https://casino1.com', 'anna@casino1.com', 'CASINO1_WELCOME, CASINO1_BONUS', 'partner_casino_1', '2025-08-15 11:47:54.680003', 'activated', 'promo_webs_50', '2025-08-17 11:47:54.699034', '2025-08-17 11:47:54.699034') RETURNING "id"

    ]

    additional_requests.each do |req_data|
      MarketingRequest.create!(
        manager: req_data[:manager],
        platform: req_data[:platform],
        partner_email: req_data[:email],
        promo_code: req_data[:codes].join(", "),
        stag: req_data[:stag],
        status: [ "pending", "activated" ].sample,
        request_type: req_data[:type],
        activation_date: rand(2) == 0 ? nil : rand(2).days.ago
      )
    end

    puts "\nСоздано #{MarketingRequest.count} заявок согласно партнерским правилам"
---
INSERT INTO "marketing_requests" ("manager", "platform", "partner_email", "promo_code", "stag", "activation_date", "status", "request_type", "created_at", "updated_at") VALUES ('Игорь Семенов', 'https://additional-partner.com', 'igor@additional.com', 'ADDITIONAL_125', 'additional_partner_1', '2025-08-16 11:47:54.717541', 'activated', 'promo_no_link_125', '2025-08-17 11:47:54.720002', '2025-08-17 11:47:54.720002') RETURNING "id"
SELECT COUNT(*) FROM "marketing_requests"

    # Выводим статистику
    puts "\nРаспределение по типам:"
    MarketingRequest::REQUEST_TYPES.each do |type|
      count = MarketingRequest.by_request_type(type).count
---
SELECT COUNT(*) FROM "marketing_requests" WHERE "marketing_requests"."request_type" = 'promo_webs_50'


    puts "\nСтатистика по статусам:"
    MarketingRequest::STATUSES.each do |status|
      count = MarketingRequest.by_status(status).count
      puts "  #{MarketingRequest::STATUS_LABELS[status]}: #{count} заявок"
    end

    puts "\nВсе STAG уникальны: #{MarketingRequest.distinct.count(:stag) == MarketingRequest.count}"
---
SELECT COUNT(*) FROM "marketing_requests" WHERE "marketing_requests"."status" = 'pending'
SELECT COUNT(DISTINCT "marketing_requests"."stag") FROM "marketing_requests"