app/views/bonuses/_type_specific_details.html.erb

SELECT "bonus_rewards".* FROM "bonus_rewards" WHERE "bonus_rewards"."bonus_id" = 76
---
        <% if bonus.all_rewards.any? %>
          <% if bonus.bonus_rewards.any? %>

SELECT "freespin_rewards".* FROM "freespin_rewards" WHERE "freespin_rewards"."bonus_id" = 76
---

          <% if bonus.freespin_rewards.any? %>

SELECT "bonus_buy_rewards".* FROM "bonus_buy_rewards" WHERE "bonus_buy_rewards"."bonus_id" = 76
---

          <% if bonus.bonus_buy_rewards.any? %>

SELECT "freechip_rewards".* FROM "freechip_rewards" WHERE "freechip_rewards"."bonus_id" = 76
---

          <% if bonus.freechip_rewards.any? %>

SELECT "material_prize_rewards".* FROM "material_prize_rewards" WHERE "material_prize_rewards"."bonus_id" = 76
---

          <% if bonus.material_prize_rewards.any? %>

SELECT "comp_point_rewards".* FROM "comp_point_rewards" WHERE "comp_point_rewards"."bonus_id" = 76
---

          <% if bonus.comp_point_rewards.any? %>

SELECT "bonus_code_rewards".* FROM "bonus_code_rewards" WHERE "bonus_code_rewards"."bonus_id" = 76
---

          <% if bonus.bonus_code_rewards.any? %>