app/views/bonuses/_type_specific_form.html.erb

            <!-- Load existing bonus rewards -->
            <% if bonus.bonus_rewards.any? %>
---
SELECT "bonus_rewards".* FROM "bonus_rewards" WHERE "bonus_rewards"."bonus_id" = 75
SELECT 1 AS one FROM "bonus_rewards" WHERE "bonus_rewards"."bonus_id" = 77 LIMIT 1

            <!-- Load existing freespin rewards -->
            <% if bonus.freespin_rewards.any? %>
---
SELECT "freespin_rewards".* FROM "freespin_rewards" WHERE "freespin_rewards"."bonus_id" = 75
SELECT 1 AS one FROM "freespin_rewards" WHERE "freespin_rewards"."bonus_id" = 77 LIMIT 1

            <!-- Load existing bonus buy rewards -->
            <% if bonus.bonus_buy_rewards.any? %>
---
SELECT "bonus_buy_rewards".* FROM "bonus_buy_rewards" WHERE "bonus_buy_rewards"."bonus_id" = 75
SELECT 1 AS one FROM "bonus_buy_rewards" WHERE "bonus_buy_rewards"."bonus_id" = 77 LIMIT 1

            <!-- Load existing comp point rewards -->
            <% if bonus.comp_point_rewards.any? %>
---
SELECT "comp_point_rewards".* FROM "comp_point_rewards" WHERE "comp_point_rewards"."bonus_id" = 75
SELECT 1 AS one FROM "comp_point_rewards" WHERE "comp_point_rewards"."bonus_id" = 77 LIMIT 1

            <!-- Load existing bonus code rewards -->
            <% if bonus.bonus_code_rewards.any? %>
---
SELECT "bonus_code_rewards".* FROM "bonus_code_rewards" WHERE "bonus_code_rewards"."bonus_id" = 75
SELECT 1 AS one FROM "bonuses" WHERE "bonuses"."code" = 'WELCOME' LIMIT 1
SELECT 1 AS one FROM "bonus_code_rewards" WHERE "bonus_code_rewards"."bonus_id" = 77 LIMIT 1

          <!-- Hidden sections for dynamic content -->
          <div id="bonus-rewards-section" style="<%= 'display: none;' unless bonus.persisted? && bonus.bonus_rewards.any? %>"></div>
          <div id="freespin-rewards-section" style="<%= 'display: none;' unless bonus.persisted? && bonus.freespin_rewards.any? %>"></div>
          <div id="bonus-buy-rewards-section" style="<%= 'display: none;' unless bonus.persisted? && bonus.bonus_buy_rewards.any? %>"></div>
          <div id="comp-point-rewards-section" style="<%= 'display: none;' unless bonus.persisted? && bonus.comp_point_rewards.any? %>"></div>
          <div id="bonus-code-rewards-section" style="<%= 'display: none;' unless bonus.persisted? && bonus.bonus_code_rewards.any? %>"></div>
---
SELECT 1 AS one FROM "bonus_rewards" WHERE "bonus_rewards"."bonus_id" = 77 LIMIT 1
SELECT 1 AS one FROM "freespin_rewards" WHERE "freespin_rewards"."bonus_id" = 77 LIMIT 1
SELECT 1 AS one FROM "bonus_buy_rewards" WHERE "bonus_buy_rewards"."bonus_id" = 77 LIMIT 1
SELECT 1 AS one FROM "comp_point_rewards" WHERE "comp_point_rewards"."bonus_id" = 77 LIMIT 1
SELECT 1 AS one FROM "bonus_code_rewards" WHERE "bonus_code_rewards"."bonus_id" = 77 LIMIT 1


  let bonusRewardIndex = <%= bonus.persisted? ? bonus.bonus_rewards.count : 0 %>;
  let freespinRewardIndex = <%= bonus.persisted? ? bonus.freespin_rewards.count : 0 %>;
  let bonusBuyRewardIndex = <%= bonus.persisted? ? bonus.bonus_buy_rewards.count : 0 %>;
  let compPointRewardIndex = <%= bonus.persisted? ? bonus.comp_point_rewards.count : 0 %>;
  let bonusCodeRewardIndex = <%= bonus.persisted? ? bonus.bonus_code_rewards.count : 0 %>;
---
SELECT COUNT(*) FROM "bonus_rewards" WHERE "bonus_rewards"."bonus_id" = 77
SELECT COUNT(*) FROM "freespin_rewards" WHERE "freespin_rewards"."bonus_id" = 77
SELECT COUNT(*) FROM "bonus_buy_rewards" WHERE "bonus_buy_rewards"."bonus_id" = 77
SELECT COUNT(*) FROM "comp_point_rewards" WHERE "comp_point_rewards"."bonus_id" = 77
SELECT COUNT(*) FROM "bonus_code_rewards" WHERE "bonus_code_rewards"."bonus_id" = 77