app/controllers/api/v1/bonuses_controller.rb

SELECT "deposit_bonuses".* FROM "deposit_bonuses" WHERE "deposit_bonuses"."bonus_id" IN (200, 199, 198, 197, 196, 195, 194, 193, 192, 191, 190, 189, 188, 187, 186, 185, 184, 183, 182, 181)
SELECT "input_coupon_bonuses".* FROM "input_coupon_bonuses" WHERE "input_coupon_bonuses"."bonus_id" IN (200, 199, 198, 197, 196, 195, 194, 193, 192, 191, 190, 189, 188, 187, 186, 185, 184, 183, 182, 181)
SELECT "manual_bonuses".* FROM "manual_bonuses" WHERE "manual_bonuses"."bonus_id" IN (200, 199, 198, 197, 196, 195, 194, 193, 192, 191, 190, 189, 188, 187, 186, 185, 184, 183, 182, 181)
SELECT "collect_bonuses".* FROM "collect_bonuses" WHERE "collect_bonuses"."bonus_id" IN (200, 199, 198, 197, 196, 195, 194, 193, 192, 191, 190, 189, 188, 187, 186, 185, 184, 183, 182, 181)
SELECT COUNT(*) FROM "bonuses"
SELECT "bonuses".* FROM "bonuses" ORDER BY "bonuses"."created_at" DESC LIMIT 20 OFFSET 0
---
  def index
    @bonuses = Bonus.includes(:deposit_bonus, :input_coupon_bonus, :manual_bonus,
                             :collect_bonus, :groups_update_bonus, :scheduler_bonus)

    # Apply filters
    @bonuses = apply_filters(@bonuses)

    # Pagination
    page = (params[:page] || 1).to_i
    per_page = [(params[:per_page] || 20).to_i, 100].min
    offset = (page - 1) * per_page

    total_count = @bonuses.count
    @bonuses = @bonuses.limit(per_page).offset(offset)

SELECT "bonuses".* FROM "bonuses" WHERE "bonuses"."id" = 201 LIMIT 1
---
  def set_bonus
    @bonus = Bonus.find(params[:id])