app/controllers/bonuses_controller.rb

SELECT "bonuses".* FROM "bonuses" WHERE (name LIKE '%Test%' OR code LIKE '%Test%') ORDER BY "bonuses"."created_at" DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "bonuses"
SELECT "bonuses".* FROM "bonuses" ORDER BY "bonuses"."created_at" DESC LIMIT 20 OFFSET 0
---
  def index
    @bonuses = Bonus.includes(:bonus_rewards, :freespin_rewards, :bonus_buy_rewards,
                             :freechip_rewards, :bonus_code_rewards, :material_prize_rewards, :comp_point_rewards)

    # Filter by event if specified
    @bonuses = @bonuses.by_event(params[:type] || params[:event]) if (params[:type] || params[:event]).present?

    # Filter by status if specified
    case params[:status]
    when "active"
      @bonuses = @bonuses.active
    when "inactive"
      @bonuses = @bonuses.inactive
    when "expired"
      @bonuses = @bonuses.expired
    end

    # Filter by currency if specified
    @bonuses = @bonuses.by_currency(params[:currency] || params[:currencies]&.first) if (params[:currency] || params[:currencies]).present?

    # Filter by country if specified
    @bonuses = @bonuses.by_country(params[:country]) if params[:country].present?

SELECT "freespin_rewards".* FROM "freespin_rewards" WHERE "freespin_rewards"."bonus_id" = 77
---
    # Validate freespin rewards before saving bonus
    freespin_reward_params = self.freespin_reward_params
    Rails.logger.debug "Freespin reward params: #{freespin_reward_params.inspect}"
    if freespin_reward_params.present?

SELECT 1 AS one FROM "bonuses" WHERE "bonuses"."code" = 'WELCOME' LIMIT 1
---
          create_comp_point_reward_if_provided
        end
        # Create multiple bonus_code rewards if provided
        if params[:bonus_code_rewards].present? || params.dig(:bonus, :bonus_code_rewards).present?