app/controllers/bonuses_controller.rb

SELECT "bonus_buy_rewards".* FROM "bonus_buy_rewards" WHERE "bonus_buy_rewards"."bonus_id" IN (75, 74, 73, 72, 71, 70, 69, 68, 67, 66, 65, 64, 63, 62, 61, 60, 59, 58, 57, 56, 55, 54, 53, 52, 51)
SELECT "bonus_code_rewards".* FROM "bonus_code_rewards" WHERE "bonus_code_rewards"."bonus_id" IN (75, 74, 73, 72, 71, 70, 69, 68, 67, 66, 65, 64, 63, 62, 61, 60, 59, 58, 57, 56, 55, 54, 53, 52, 51)
SELECT "bonus_rewards".* FROM "bonus_rewards" WHERE "bonus_rewards"."bonus_id" IN (75, 74, 73, 72, 71, 70, 69, 68, 67, 66, 65, 64, 63, 62, 61, 60, 59, 58, 57, 56, 55, 54, 53, 52, 51)
SELECT "comp_point_rewards".* FROM "comp_point_rewards" WHERE "comp_point_rewards"."bonus_id" IN (75, 74, 73, 72, 71, 70, 69, 68, 67, 66, 65, 64, 63, 62, 61, 60, 59, 58, 57, 56, 55, 54, 53, 52, 51)
SELECT 1 AS one FROM "bonuses" WHERE (name LIKE '%Test%' OR code LIKE '%Test%') LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "bonuses"
SELECT 1 AS one FROM "bonuses" WHERE "bonuses"."project" = 'VOLNA' AND (dsl_tag LIKE '%test_bonus_volna_001%') LIMIT 1 OFFSET 0
---
  def index
    @bonuses = Bonus.includes(:bonus_rewards, :freespin_rewards, :bonus_buy_rewards,
                             :freechip_rewards, :bonus_code_rewards, :material_prize_rewards, :comp_point_rewards)

    # Filter by event if specified
    @bonuses = @bonuses.by_event(params[:type] || params[:event]) if (params[:type] || params[:event]).present?

    # Filter by status if specified
    case params[:status]
    when "active"
      @bonuses = @bonuses.active
    when "inactive"
      @bonuses = @bonuses.inactive
    when "expired"
      @bonuses = @bonuses.expired
    end

    # Filter by currency if specified
    @bonuses = @bonuses.by_currency(params[:currency]) if params[:currency].present?

    # Filter by country if specified
    @bonuses = @bonuses.by_country(params[:country]) if params[:country].present?

    # Filter by project if specified
    @bonuses = @bonuses.by_project(params[:project]) if params[:project].present?

INSERT INTO "bonuses" ("name", "code", "status", "minimum_deposit", "wager", "maximum_winnings", "wagering_strategy", "availability_start_date", "availability_end_date", "user_group", "tags", "country", "currency", "created_by", "updated_by", "created_at", "updated_at", "project", "dsl_tag", "event") VALUES ('Test New Event System Bonus', 'BONUS_54B0B931', 'draft', NULL, NULL, NULL, '', '2025-08-14 20:02:00', '2025-09-14 20:02:00', '', '', '', 'USD', NULL, NULL, '2025-08-14 20:02:59.284324', '2025-08-14 20:02:59.284324', '', 'test_new_events', 'deposit') RETURNING "id"
---
  def create
    @bonus = Bonus.new(bonus_params)

    respond_to do |format|
      if @bonus.save

UPDATE "bonuses" SET "wagering_strategy" = '', "updated_at" = '2025-08-17 10:24:13.513671', "currency_minimum_deposits" = '{}', "description" = 'Bonus for new players with 100% match on first deposit' WHERE "bonuses"."id" = 1
---
  def update
    # Debug logging
    Rails.logger.debug "Update params: #{params.inspect}"
    Rails.logger.debug "Bonus params: #{bonus_params.inspect}"
    Rails.logger.debug "Currency minimum deposits params: #{params[:bonus][:currency_minimum_deposits].inspect}"

    respond_to do |format|
      if @bonus.update(bonus_params)

DELETE FROM "bonuses" WHERE "bonuses"."id" = 77
---
  def destroy
    @bonus.destroy

SELECT "bonuses".* FROM "bonuses" WHERE "bonuses"."id" = 1 LIMIT 1
---
  def bulk_update
    bonus_ids = params[:bonus_ids] || []
    action = params[:bulk_action]

    bonuses = Bonus.where(id: bonus_ids)

SELECT "bonuses".* FROM "bonuses" WHERE "bonuses"."id" = 1 LIMIT 1
---
  def set_bonus
    @bonus = Bonus.find(params[:id])