app/controllers/heatmap_controller.rb

  def index
    # Получаем валидированные параметры
    @year = parse_year_param(heatmap_params[:year])
    @month = parse_month_param(heatmap_params[:month])
    @bonus_event = parse_bonus_event_param(heatmap_params[:bonus_event])

    # Создаем дату начала и конца месяца с обработкой ошибок
    begin
      @start_date = Date.new(@year, @month, 1)
      @end_date = @start_date.end_of_month
    rescue Date::Error
      # Fallback to current date if invalid parameters
      @year = Date.current.year
      @month = Date.current.month
      @start_date = Date.new(@year, @month, 1)
      @end_date = @start_date.end_of_month
    end

    # Получаем данные о бонусах для текущего месяца
    @heatmap_data = generate_heatmap_data
    @calendar_start = @start_date.beginning_of_week(:monday)
    @calendar_end = @end_date.end_of_week(:sunday)
    @comment_counts = comment_counts_by_date

    # Получаем список событий бонусов для фильтра
    @bonus_events = Bonus.distinct.pluck(:event).compact.sort
---
SELECT DISTINCT "bonuses"."event" FROM "bonuses"