app/controllers/marketing_controller.rb

SELECT "marketing_requests".* FROM "marketing_requests" WHERE "marketing_requests"."request_type" = 'promo_no_link_125' AND (LOWER(promo_code) LIKE '%orangemorange%' OR LOWER(stag) LIKE '%orangemorange%' OR LOWER(manager) LIKE '%orangemorange%' OR LOWER(partner_email) LIKE '%orangemorange%') ORDER BY "marketing_requests"."created_at" ASC
SELECT "marketing_requests".* FROM "marketing_requests" WHERE "marketing_requests"."request_type" = 'promo_webs_100' AND "marketing_requests"."status" = 'rejected' ORDER BY "marketing_requests"."created_at" ASC
SELECT COUNT(*) FROM "marketing_requests" WHERE "marketing_requests"."request_type" = 'promo_webs_50'
---
  def index
    @current_tab = params[:tab] || MarketingRequest::REQUEST_TYPES.first

    # Start with base query - filter by tab only if no search or status filter
    if params[:search].present? || params[:status].present?
      @marketing_requests = MarketingRequest.all.order(:created_at)
    else
      @marketing_requests = MarketingRequest.by_request_type(@current_tab).order(:created_at)
    end

    # Filter by status if provided
    if params[:status].present? && MarketingRequest::STATUSES.include?(params[:status])
      @marketing_requests = @marketing_requests.by_status(params[:status])
    end

    # Search functionality
    if params[:search].present?
      search_term = params[:search].strip.downcase
      @marketing_requests = @marketing_requests.where(
        "LOWER(promo_code) LIKE ? OR LOWER(stag) LIKE ? OR LOWER(manager) LIKE ? OR LOWER(partner_email) LIKE ?",
        "%#{search_term}%", "%#{search_term}%", "%#{search_term}%", "%#{search_term}%"
      )
    end

    @tabs = MarketingRequest::REQUEST_TYPES.map do |type|
      {
        key: type,
        label: MarketingRequest::REQUEST_TYPE_LABELS[type],
        count: MarketingRequest.by_request_type(type).count

INSERT INTO "marketing_requests" ("manager", "platform", "partner_email", "promo_code", "stag", "activation_date", "status", "request_type", "created_at", "updated_at") VALUES ('паша дурак ', 'rutube', 'p.rusakevich@jetmail.cc', 'ORANGEMORANGE', '423784', '2025-08-10 18:32:00', 'pending', 'promo_no_link_125', '2025-08-17 15:32:30.983177', '2025-08-17 15:32:30.983177') RETURNING "id"
---
  def create
    @marketing_request = MarketingRequest.new(marketing_request_params)

    if @marketing_request.save

UPDATE "marketing_requests" SET "promo_code" = 'CASINO1_WELCOME123123, CASINO1_BONUS', "activation_date" = NULL, "status" = 'pending', "updated_at" = '2025-08-17 11:50:47.149779' WHERE "marketing_requests"."id" = 23
---
  def update
    if @marketing_request.update(marketing_request_params)

SELECT "marketing_requests".* FROM "marketing_requests" WHERE "marketing_requests"."id" != 23 AND (UPPER(promo_code) LIKE '%CASINO1_WELCOME123123%')
---
  def set_marketing_request
    @marketing_request = MarketingRequest.find(params[:id])