app/models/bonus.rb

  def self.find_permanent_bonus_for_project(project, dsl_tag)
---
SELECT "bonuses".* FROM "bonuses" WHERE "bonuses"."project" = 'VOLNA' AND "bonuses"."dsl_tag" = 'welcome' AND "bonuses"."status" = 'active' ORDER BY "bonuses"."id" ASC LIMIT 1

  def reward_types
    types = []
    types << "bonus" if bonus_rewards.any?
    types << "freespins" if freespin_rewards.any?
    types << "bonus_buy" if bonus_buy_rewards.any?
    types << "freechips" if freechip_rewards.any?
    types << "bonus_code" if bonus_code_rewards.any?
---
SELECT 1 AS one FROM "bonuses" WHERE "bonuses"."code" = 'BONUS_7EE48A23' LIMIT 1

  def self.update_expired_bonuses!
    active.where("availability_end_date < ?", Time.current)
          .update_all(status: "inactive")
---
UPDATE "bonuses" SET "status" = 'inactive' WHERE "bonuses"."id" = 79
UPDATE "bonuses" SET "status" = 'inactive' WHERE "bonuses"."status" = 'active' AND (availability_end_date < '2025-08-17 15:49:31.279334')

  def generate_code
    loop do
      self.code = "BONUS_#{SecureRandom.hex(4).upcase}"
      break unless self.class.exists?(code: code)
---
SELECT 1 AS one FROM "bonuses" WHERE "bonuses"."code" = 'BONUS_225A1976' LIMIT 1