app/models/bonus.rb

SELECT 1 AS one FROM "bonuses" WHERE "bonuses"."code" = 'BONUS_54B0B931' LIMIT 1
---
  def reward_types
    types = []
    types << "bonus" if bonus_rewards.any?
    types << "freespins" if freespin_rewards.any?
    types << "bonus_buy" if bonus_buy_rewards.any?
    types << "freechips" if freechip_rewards.any?
    types << "bonus_code" if bonus_code_rewards.any?