app/models/marketing_request.rb

  def promo_codes_array
    return [] if promo_code.blank?
---
SELECT 1 AS one FROM "marketing_requests" WHERE LOWER("marketing_requests"."promo_code") = LOWER('TESTPROMO123') AND "marketing_requests"."id" != 22 LIMIT 1

  def existing_partner_request
    return nil if stag.blank?
    self.class.where(stag: stag).where.not(id: id).first
---
SELECT "marketing_requests".* FROM "marketing_requests" WHERE "marketing_requests"."stag" = 'stag_promo_webs_50_0_0' AND "marketing_requests"."id" != 1 ORDER BY "marketing_requests"."id" ASC LIMIT 1

  def stag_uniqueness_across_all_types
    return if stag.blank?

    existing_request = self.class.where(stag: stag).where.not(id: id).first
---
SELECT "marketing_requests".* FROM "marketing_requests" WHERE "marketing_requests"."stag" = 'partner_casino_1' AND "marketing_requests"."id" IS NOT NULL ORDER BY "marketing_requests"."id" ASC LIMIT 1